{"totalArticles":57225,"articles":[{"title":"NASA's Artemis moon mission ends with splashdown","description":"The Artemis I mission around the moon meant to pave the way for future astronaut missions — came to an momentous end as NASA's Orion spacecraft made a successful ocean splashdown Sunday.","content":"Sign up for CNN’s Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\nCNN —\nThe Artemis I mission — a 25½-day uncrewed test flight around the moon meant to pave the way for fu... [5577 chars]","url":"https://www.cnn.com/2022/12/11/world/nasa-splashdown-artemis-i-orion-sunday-scn/index.html","image":"https://media.cnn.com/api/v1/images/stellar/prod/221211124024-01-artemis-splashdown-121122.jpg?c=16x9\u0026q=w_800,c_fill","publishedAt":"2022-12-11T19:55:00Z","source":{"name":"CNN","url":"https://www.cnn.com"}},{"title":"Serbs in Kosovo clash with police as ethnic tensions flare","description":"Serb protesters in northern Kosovo blocked main roads for a second day on Sunday following a nighttime exchange of fire with police after the arrest of a former Serb policeman, amid rising tensions between authorities and Kosovo's Serb minority.","content":"[1/5] Members of the Polish Armed Forces, part of NATO peacekeepers mission in Kosovo, stay in a vehicle near the barricade in the northern part of the ethnically-divided town of Mitrovica, Kosovo, December 11, 2022. REUTERS/Florion Goga\nMITROVICA, K... [3654 chars]","url":"https://www.reuters.com/world/europe/serbs-kosovo-block-roads-clash-with-police-ethnic-tensions-worsen-2022-12-11/","image":"https://www.reuters.com/resizer/RiWOhyw3TC41BGqIB4Pb2OQg3ag=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/EQXUJQX24JJSVNBOREJZABA2OY.jpg","publishedAt":"2022-12-11T19:08:00Z","source":{"name":"Reuters","url":"https://www.reuters.com"}},{"title":"Arizona Gov. Ducey stacks containers on border at term's end","description":"SAN RAFAEL VALLEY, Arizona (AP) — Work crews have steadily erected hundreds of double-stacked shipping containers topped by razor wire along Arizona’s remote eastern boundary with Mexico in a bold show of border enforcement by Republican Gov.","content":"A long row of double-stacked shipping contrainers provide a new wall between the United States and Mexico in the remote section area of San Rafael Valley, Ariz., Thursday, Dec. 8, 2022. Work crews are steadily erecting hundreds of double-stacked ship... [8005 chars]","url":"https://apnews.com/article/politics-arizona-doug-ducey-united-states-government-katie-hobbs-4e5730c50ba665b51a6d6afaf99c46ee","image":"https://storage.googleapis.com/afs-prod/media/bd23521ba6fb4b83bb053c1bd2435318/3000.webp","publishedAt":"2022-12-11T17:56:44Z","source":{"name":"The Associated Press - en Español","url":"https://apnews.com"}},{"title":"U.S. Commandos Kill Two Islamic State Officials in Syria","description":"Special Operations forces carried out an overnight helicopter raid at the compound of an official who the military said was involved in plotting and enabling terrorist attacks.","content":"WASHINGTON — U.S. Special Operations forces carried out a helicopter raid against the Islamic State in northeastern Syria early Sunday, killing two operatives, including one official who the military said was involved in plotting and enabling terrori... [943 chars]","url":"https://www.nytimes.com/2022/12/11/us/politics/us-isis-syria.html","image":"https://static01.nyt.com/images/2022/12/11/multimedia/11dc-isis1-1-4e20/11dc-isis1-1-4e20-facebookJumbo.jpg","publishedAt":"2022-12-11T17:53:28Z","source":{"name":"The New York Times","url":"https://www.nytimes.com"}},{"title":"Georgia Holt Dies: Mother Of Cher, Actress, Model And Singer Was 96","description":"Cher's mother, Georgia Holt, has died at age 96, it was revealed on social media.","content":"Georgia Holt, best known as Cher’s mother but an actress, model, and singer in her own right, has died. Cher confirmed the death on social media. Holt was 96 and no details on her death were given, although it was previously revealed she was hospital... [1023 chars]","url":"https://deadline.com/2022/12/georgia-holt-dies-mother-cher-actress-model-singer-was-96-1235195974/","image":"https://deadline.com/wp-content/uploads/2022/12/GettyImages-455325423.jpg?w=856","publishedAt":"2022-12-11T17:22:00Z","source":{"name":"Deadline","url":"https://deadline.com"}},{"title":"Congressional Republicans divided on attacking Trump investigations","description":"The former president’s closest allies are working to discredit a potential prosecution by raising claims of politicization at the FBI and Justice Department.","content":"Listen Comment on this story Comment Gift Article Share\nRepublicans in Congress are splintering over how aggressively to run interference for former president Donald Trump as he faces potential criminal prosecution, with only his closest allies plann... [12182 chars]","url":"https://www.washingtonpost.com/politics/2022/12/12/trump-investigations-republicans-congress/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HQXVUPBPUMI63PGGBB2LE2XCSY.jpg\u0026w=1440","publishedAt":"2022-12-11T16:44:00Z","source":{"name":"The Washington Post","url":"https://www.washingtonpost.com"}},{"title":"Sen. Sinema's switch to Independent will not impact Democrats' control of the chamber, representatives say","description":"Many members of Congress have said Sinema's switch likely won't impact the Democrats' narrow control of the U.S. Senate.","content":"Senator Kyrsten Sinema, a Democrat from Arizona, speaks during a Senate Homeland Security and Governmental Affairs Committee confirmation hearing for Shalanda Young, director of the Office of Management and Budget (OMB) nominee for U.S. President Joe... [2482 chars]","url":"https://www.cnbc.com/2022/12/11/sen-sinemas-switch-to-independent-will-not-impact-democrats-control-of-the-chamber-representatives-say.html","image":"https://image.cnbcfm.com/api/v1/image/107009521-16437337022022-02-01t163120z_1090655761_rc23bs9r3va8_rtrmadp_0_usa-biden-budget.jpeg?v=1670775921\u0026w=1920\u0026h=1080","publishedAt":"2022-12-11T16:25:21Z","source":{"name":"CNBC","url":"https://www.cnbc.com"}},{"title":"Live Updates: NASA’s Artemis I Moon Mission Returns to Earth","description":"The Orion spacecraft, which is to carry astronauts to and from the moon in coming years, will splash down in the Pacific Ocean Sunday after a test flight with no crew aboard.","content":"And on the 26th day, the moon capsule returned to Earth.\nDuring the early hours of Nov. 16, NASA launched a giant rocket toward the moon. The rocket reached orbit and sent a small capsule, this time with no astronauts on board, on its way to the moon... [2809 chars]","url":"https://www.nytimes.com/live/2022/12/11/science/nasa-artemis-orion-splashdown","image":"https://static01.nyt.com/images/2022/12/09/multimedia/live-blog-20221211-nasa-artemis-orion-splashdown-header-1-12dd/live-blog-20221211-nasa-artemis-orion-splashdown-header-1-12dd-articleLarge.jpg","publishedAt":"2022-12-11T15:26:07Z","source":{"name":"The New York Times","url":"https://www.nytimes.com"}},{"title":"Sanders calls Sinema ‘corporate Democrat’ who ‘sabotaged’ legislation","description":"Sen. Bernie Sanders (I-Vt.) slammed Sen. Kyrsten Sinema (I-Ariz.) on Sunday as a “corporate Democrat” who “sabotaged” party priorities following her announcement that she was becoming an Independent. During an appearance on CNN’s “State of the Union” with co-anchor Dana Bash, Sanders said Sinema didn’t have the guts to take on special interests while attacking…","content":"Sen. Bernie Sanders (I-Vt.) slammed Sen. Kyrsten Sinema (I-Ariz.) on Sunday as a “corporate Democrat” who “sabotaged” party priorities following her announcement that she was becoming an Independent.\nDuring an appearance on CNN’s “State of the Union”... [2692 chars]","url":"https://thehill.com/homenews/sunday-talk-shows/3770717-sanders-calls-sinema-corporate-democrat-who-sabotaged-legislation/","image":"https://thehill.com/wp-content/uploads/sites/2/2022/09/sandersbernie_090822gn3_w.jpg?w=1280","publishedAt":"2022-12-11T15:02:00Z","source":{"name":"The Hill","url":"https://thehill.com"}},{"title":"Galaxy S23 can record slightly smoother 8K videos","description":"The Samsung Galaxy S23 series will have improved camera performance, and according to reports, it can record smoother 8K videos. - SamMobile","content":"Apart from the 200MP camera sensor on the Galaxy S23 Ultra, Samsung might not bring any significant camera improvement on the hardware level. However, we can still expect improved image and video quality, thanks to a better chipset and improved softw... [1166 chars]","url":"https://www.sammobile.com/news/galaxy-s23-smoother-8k-video-recording/","image":"https://www.sammobile.com/wp-content/uploads/2022/09/GALAXY-S23-ULTRA-5K3-scaled-720x405.jpg","publishedAt":"2022-12-11T14:08:00Z","source":{"name":"SamMobile - Samsung news","url":"https://www.sammobile.com"}}]}