{"totalArticles":56931,"articles":[{"title":"Peru President Castillo impeached after he attempts to dissolve Congress","description":"Peru's found itself in a renewed period of political uncertainty on Wednesday as Congress defied President Pedro Castillo and voted to impeach him, hours after he attempted to dissolve the legislative body and install an emergency government.","content":"CNN —\nPolitical tumult swept Peru on Wednesday, with the country’s congress voting to impeach President Pedro Castillo just hours after he attempted to dissolve the legislative body and install an emergency government.\nThe day began with Castillo mak... [4813 chars]","url":"https://www.cnn.com/2022/12/07/americas/peru-president-castillo-congress-dissolves-intl/index.html","image":"https://media.cnn.com/api/v1/images/stellar/prod/221207095151-pedro-castillo-100522.jpg?c=16x9\u0026q=w_800,c_fill","publishedAt":"2022-12-07T19:07:00Z","source":{"name":"CNN","url":"https://www.cnn.com"}},{"title":"Stocks making the biggest moves midday: Carvana, MongoDB, TripAdvisor, Toll Brothers and more","description":"These are the stocks posting the largest moves in midday trading.","content":"A mascot of TripAdvisor is seen at its display at a trade fair.\nCheck out the companies making headlines in midday trading.\nCarvana — Shares of the online car dealership fell more than 32% after Carvana's largest creditors signed an agreement to nego... [3257 chars]","url":"https://www.cnbc.com/2022/12/07/stocks-making-the-biggest-moves-midday-carvana-mongodb-tripadvisor-toll-brothers-and-more.html","image":"https://image.cnbcfm.com/api/v1/image/104178186-RTR4S28V.jpg?v=1670435977\u0026w=1920\u0026h=1080","publishedAt":"2022-12-07T17:59:37Z","source":{"name":"CNBC","url":"https://www.cnbc.com"}},{"title":"Oldest DNA reveals life in Greenland 2 million years ago","description":"NEW YORK (AP) — Scientists discovered the oldest known DNA and used it to reveal what life was like 2 million years ago in the northern tip of Greenland. Today, it’s a barren Arctic desert, but back then it was a lush landscape of trees and vegetation with an array of animals, even the now extinct mastodon.","content":"This illustration provided by researchers depicts Kap Kobenhavn, Greenland, two million years ago, when the temperature was significantly warmer than northernmost Greenland today. Scientists have analyzed 2-million-year-old DNA extracted from dirt sa... [5380 chars]","url":"https://apnews.com/article/science-health-fossils-animals-genetics-77553eb8372e4830794de18f4f74e837","image":"https://storage.googleapis.com/afs-prod/media/ac6da12cd69547d683598bd29efa52b1/3000.webp","publishedAt":"2022-12-07T17:50:48Z","source":{"name":"The Associated Press - en Español","url":"https://apnews.com"}},{"title":"Suspected German coup plot spawns dozens of arrests","description":"BERLIN (AP) — German police seized dozens of people including a self-styled prince, a retired paratrooper and a former judge on Wednesday, accusing the suspects of discussing the violent overthrow of the government but leaving unclear how concrete the plans were.","content":"Masked police officers lead Heinrich XIII Prince Reuss, center, to a police vehicle during a raid against so-called 'Reich citizens' in Frankfurt, Germany, Wednesday, Dec. 7, 2022. Thousands of police carried out a series of raids across much of Germ... [6503 chars]","url":"https://apnews.com/article/europe-germany-constitutions-d7e67cfefbd1f33e2909f9c2fe1a3d3d","image":"https://storage.googleapis.com/afs-prod/media/9d2896cf4dd645ec87da107ba61ecaca/3000.webp","publishedAt":"2022-12-07T17:42:58Z","source":{"name":"The Associated Press - en Español","url":"https://apnews.com"}},{"title":"Aaron Judge Returning to Yankees on $360 Million Deal","description":"Judge, who hit 62 home runs in 2022 and won the A.L.’s Most Valuable Player Award, is back for nine more seasons with the club that drafted him.","content":"SAN DIEGO — Aaron Judge’s record-smashing year is ending with one more big swing. Like his others, it is sending the Yankees smiling into tomorrow.\nNine months after declining a $213.5 million contract extension from the Yankees, Judge, who proceeded... [1378 chars]","url":"https://www.nytimes.com/2022/12/07/sports/baseball/aaron-judge-yankees.html","image":"https://static01.nyt.com/images/2022/12/06/multimedia/06mlb-judge-top1-1-3e92/06mlb-judge-top1-1-3e92-facebookJumbo.jpg","publishedAt":"2022-12-07T17:25:23Z","source":{"name":"The New York Times","url":"https://www.nytimes.com"}},{"title":"Trump Hired Team to Search His Properties for Classified Material","description":"The searches, conducted after a federal judge directed the former president’s lawyers to look for any documents still in his possession, are said to have found no additional sensitive material.","content":"Former President Donald J. Trump hired people to search three of his properties after being directed by a federal judge to look harder for any classified material still in his possession, and they did not find anything, according to two people famili... [795 chars]","url":"https://www.nytimes.com/2022/12/07/us/politics/trump-classified-documents-search.html","image":"https://static01.nyt.com/images/2022/12/07/multimedia/07dc-investigate-1-30e4/07dc-investigate-1-30e4-facebookJumbo.jpg","publishedAt":"2022-12-07T17:22:38Z","source":{"name":"The New York Times","url":"https://www.nytimes.com"}},{"title":"Oldest DNA reveals life in Greenland 2 million years ago","description":"Scientists discovered the oldest known DNA and used it to reveal what life was like 2 million years ago in the northern tip of Greenland.","content":"NEW YORK — Scientists discovered the oldest known DNA and used it to reveal what life was like 2 million years ago in the northern tip of Greenland. Today, it’s a barren Arctic desert, but back then it was a lush landscape of trees and vegetation wit... [4404 chars]","url":"https://www.nbcnews.com/science/science-news/oldest-dna-reveals-life-greenland-2-million-years-ago-rcna60562","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-12/221207-greenland-ancient-life-mjf-1204-120202.jpg","publishedAt":"2022-12-07T17:19:46Z","source":{"name":"NBC News","url":"https://www.nbcnews.com"}},{"title":"Whitey Bulger: DOJ report outlines series of mistakes that led to prison beating death of Boston gangster","description":"The Justice Department's Office of the Inspector General released a report on Wednesday outlining how a series of mistakes by the embattled Bureau of Prisons led to the beating death of imprisoned Boston gangster and convicted murderer James \"Whitey\" Bulger four years ago.","content":"Washington CNN —\nThe Justice Department’s Office of the Inspector General released a report on Wednesday outlining how a series of mistakes by the embattled Bureau of Prisons led to the beating death of imprisoned Boston gangster and convicted murder... [7481 chars]","url":"https://www.cnn.com/2022/12/07/politics/whitey-bulger-report/index.html","image":"https://media.cnn.com/api/v1/images/stellar/prod/221207111740-whitey-bulger-2011-booking-photo.jpg?c=16x9\u0026q=w_800,c_fill","publishedAt":"2022-12-07T17:04:00Z","source":{"name":"CNN","url":"https://www.cnn.com"}},{"title":"Volodymyr Zelensky named Time’s Person of the Year for 2022","description":"Volodymyr Zelensky, Ukraine’s president, drew widespread acclaim for his handling of Russia’s invasion.","content":"War in Ukraine: What you need to know\nThe latest: Russia fired at least 85 missiles on at least six major cities in Ukraine on November 15, in one of the most widespread attacks of the war so far. The strikes came just hours after Ukrainian President... [957 chars]","url":"https://www.washingtonpost.com/nation/2022/12/07/zelensky-ukraine-time-person-of-the-year/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FQXW4DAXFEI63OMYWKVWR5MENA.jpg\u0026w=1440","publishedAt":"2022-12-07T16:52:00Z","source":{"name":"The Washington Post","url":"https://www.washingtonpost.com"}},{"title":"Why the student stabbings could take time to solve","description":"The search for whoever stabbed four University of Idaho students to death last month is complicated due to an enormous amount of DNA and digital evidence.","content":"The search for whoever fatally stabbed four University of Idaho students last month includes examining an enormous amount of biological and digital evidence, a kaleidoscope of potential clues — some obvious, some unseen and some that may lead to wron... [12123 chars]","url":"https://www.nbcnews.com/news/us-news/idaho-murders-dna-digital-evidence-rcna59840","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-12/221205-idaho-university-police-investigation-cs-1b6948.jpg","publishedAt":"2022-12-07T16:52:00Z","source":{"name":"NBC News","url":"https://www.nbcnews.com"}}]}